fitness/app/controllers/events_controller.rb

  def edit
    @event = Event.find_by_id(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 1)

  def update
    @event = Event.find_by_id(params[:event][:id])
    if params[:event][:commit_button] == "Update All Occurrence"
      @events = @event.event_series.events #.find(:all, :conditions => ["starttime > '#{@event.starttime.to_formatted_s(:db)}' "])
      @event.update_events(@events, params[:event])
---
SELECT * FROM "events" WHERE ("events"."id" = 1)
UPDATE "events" SET "updated_at" = '2010-11-22 00:08:00', "name" = 'hey' WHERE "id" = 7

  def destroy
    @event = Event.find_by_id(params[:id])
    if params[:delete_all] == 'true'
      @event.event_series.destroy
---
SELECT * FROM "events" WHERE ("events"."id" = 10)
DELETE FROM "events" WHERE "id" = 10