fitness/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "password_salt", "persistence_token", "login") VALUES('2010-11-19 21:02:25', '362ccb41ab7901237430e78b1db693b3bc359ce2f105ff505180a8b84e1ce10a1c6ad291e72aa288ab8c11a2397441d7cbaac9f5374f053825160dbf249f96ea', '2010-11-19 21:02:25', '6ZXnN0fBtsVh669CK8Si', '024a330098fd071abf8a31410e53b33c108d0895ccfa34f4e1e32c6c88cd524631b1e624f3db3c71fc28697b8c4aa540316edcf99c35508e6058c718fcc384a7', 'test')
---
  def create
    @user = User.new(params[:user])
	@profile = Profile.new(params[:profile])

    if @user.save

UPDATE "users" SET "persistence_token" = 'd14a816cf457e6ca94be6a36600aa7ece83ad37a20d4ded96596348b8eec1c2a3a4bc746583af459207972f68dece953139d9829977b12a6780b608cb50fa189', "updated_at" = '2010-11-19 21:02:59', "password_salt" = '54z4NYmx0rmb9eGgg9p', "crypted_password" = '52aa6bbd633ac3b9dbe3d1362c04ac33f6fa653546b59236999de1643d9d7cc7141a7e3049089b66b10e3624777386b7b3cde2062339d06117cf45dd6260bbdd' WHERE "id" = 1
---
  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])