app/controllers/events_controller.rb

  def index
    @date = Time.parse("#{params[:start_date]} || Time.now.utc")
    @date = @date - (@date.wday==0 ? 0 : @date.wday).days
    @start_date = Date.new(@date.year, @date.month, @date.day)
    @end_date = @start_date + 7
    @event = Event.find(:all, :conditions => ['((start_at between ? and ?) or (end_at between ? and ?) or (start_at < ? and end_at > ?)) and (user_id = ? )',
                                                @start_date, @end_date, @start_date, @end_date, @start_date, @end_date, current_user.id])
---
SELECT * FROM "events" WHERE (((start_at between '2010-11-21' and '2010-11-28') or (end_at between '2010-11-21' and '2010-11-28') or (start_at < '2010-11-21' and end_at > '2010-11-28')) and (user_id = 1 ))

  def create
    @event = Event.new(params[:event])
	@event.user_id = current_user.id

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "created_at", "end_at", "updated_at", "start_at", "user_id", "event_type") VALUES('sigh', '2010-11-23 04:28:21', '2010-11-23 04:27:00', '2010-11-23 04:28:21', '2010-11-23 04:27:00', 1, 'exercise')

  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT * FROM "events" WHERE ("events"."id" = 1)
UPDATE "events" SET "updated_at" = '2010-11-22 00:08:00', "name" = 'hey' WHERE "id" = 7

  def event_workout_history
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 2)