app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
	@profile = Profile.new(params[:profile])

    if @user.save
	  @profile.user_id = @user.id
	  if @profile.save
---
INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "password_salt", "persistence_token", "login") VALUES('2010-11-19 21:02:25', '362ccb41ab7901237430e78b1db693b3bc359ce2f105ff505180a8b84e1ce10a1c6ad291e72aa288ab8c11a2397441d7cbaac9f5374f053825160dbf249f96ea', '2010-11-19 21:02:25', '6ZXnN0fBtsVh669CK8Si', '024a330098fd071abf8a31410e53b33c108d0895ccfa34f4e1e32c6c88cd524631b1e624f3db3c71fc28697b8c4aa540316edcf99c35508e6058c718fcc384a7', 'test')
INSERT INTO "profiles" ("created_at", "updated_at", "weight", "gender", "user_id", "height", "last_name", "first_name") VALUES('2010-11-22 02:28:12', '2010-11-22 02:28:12', NULL, NULL, 1, NULL, NULL, NULL)

  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "persistence_token" = 'd14a816cf457e6ca94be6a36600aa7ece83ad37a20d4ded96596348b8eec1c2a3a4bc746583af459207972f68dece953139d9829977b12a6780b608cb50fa189', "updated_at" = '2010-11-19 21:02:59', "password_salt" = '54z4NYmx0rmb9eGgg9p', "crypted_password" = '52aa6bbd633ac3b9dbe3d1362c04ac33f6fa653546b59236999de1643d9d7cc7141a7e3049089b66b10e3624777386b7b3cde2062339d06117cf45dd6260bbdd' WHERE "id" = 1

  def graph
	@user = @curret_user

	@events = Event.find(:all, :conditions => ['user_id = ?', current_user.id])

	@actual_data = Array.new
	@actual_data.push(0)
	@estimated_data = Array.new
	@estimated_data.push(0)

	@events.each do |event|
		@workout_sess = event.workout_sessions
		@workout_sess.each do |workout_sess|
---
SELECT * FROM "events" WHERE ((user_id = 1 ))
SELECT * FROM "workout_sessions" WHERE ("workout_sessions".event_id = 1)