app/controllers/workout_histories_controller.rb

INSERT INTO "workout_histories" ("created_at", "updated_at", "actual_sets", "actual_reps", "calories", "workout_session_id") VALUES('2010-11-22 00:46:10', '2010-11-22 00:46:10', 1, 10, 100, NULL)
---
  def create
    @workout_history = @workout_session.workout_histories.build(params[:workout_history])

    respond_to do |format|
      if @workout_history.save

UPDATE "workout_histories" SET "actual_reps" = 8, "updated_at" = '2010-11-22 09:59:32', "actual_sets" = 5, "calories" = 10 WHERE "id" = 1
---
  def update
    @workout_history = @workout_session.workout_history

    respond_to do |format|
      if @workout_history.update_attributes(params[:workout_history])